// Мінімум ===========================================================================================================
// Створи об'єкт, що описує автомобіль (виробник, модель, рік випуску, середня швидкість, обсяг паливного баку, середня витрата палива на 100 км., водії), і наступні методи для роботи з цим об'єктом:
// Метод, який виводить на екран інформацію про автомобіль.
// Додавання ім’я водія у список
// Перевірка водія на наявність його ім’я у списку
// Підрахунок необхідного часу та кількості палива для подолання переданої відстані з середньою швидкістю. Враховуй, що через кожні 4 години дороги водієві необхідно робити перерву на 1 годину. 

const carObject = {
	manufacturer: "skoda",
	model: "octavia",
	year: "2017",
	averageSpeed: "90",
	fuelTankCapacity: "60",
	averageFuelConsumption: '7',
	drivers: ["Leonardo", "Donatello", "Raphael", "Michelangelo", "Алекс"],
	showInfoOfAvto: function() {
		console.log(`виробник- ${carObject.manufacturer} \nмодель- ${carObject.model} \nрік випуску- ${carObject.year} рік \nсередня швидкість- ${carObject.averageSpeed} км/год \nобсяг паливного баку- ${carObject.fuelTankCapacity} літрів \nсередня витрата палива на 100 км- ${carObject.averageFuelConsumption} літрів`);
	},
	addDrivers: function(driver) {
		return carObject.drivers.push(driver);
	},
	auditDrivers: function(driver) {
		for (let one of this.drivers) {
			if (one === driver) {
				return alert(`Водій ${driver} є у списку.`);
			} else {
				return alert(`Водій ${driver} відсутній у списку.`);
			}
		}
	},
	calcTimeAndFuel: function(distance) {
		let fuel = Math.round(+carObject.averageFuelConsumption / 100 * +distance),
		minutes = +distance % +carObject.averageSpeed,
		hours = Math.floor(+distance / +carObject.averageSpeed),
		timeOfBreak = Math.floor(hours / 4);
		return alert(`Необхідно ${hours + timeOfBreak} годин та ${minutes * 0.6} хвилин та кількість палива ${fuel} літрів для подолання переданої відстані з середньою швидкістю. Враховуючи, що через кожні 4 години дороги водієві необхідно робити перерву на 1 годину.`);
	}

};
carObject.showInfoOfAvto();
carObject.addDrivers(prompt('Додайте нового водія', ''));
carObject.auditDrivers(prompt("Перевірте водія на наявність у списку, введіть ім'я", ''));
carObject.calcTimeAndFuel(prompt("Введіть відстань, для підрахунку необхідного часу та кількості палива для подолання її з середньою швидкістю.", ''));
console.log(carObject.drivers);

// Норма
// Створити об'єкт, що описує час (години, хвилини, секунди), і такі функції для роботи з цим об'єктом:
// Для виведення часу на екран.
// Зміни часу на передану кількість секунд.
// Зміни часу на передану кількість хвилин.
// Зміни часу на передану кількість годин.
// Враховуйте, що в останніх 3-х функціях, при зміні однієї частини часу, може змінитися і інша. Наприклад: якщо до часу «20:59:45» додати 30 секунд, то повинно вийти «21:00:15», а не «20:59:75». Також потрібно передбачити можливість того що користувач може передати 150 секунд, або 75 хвилин.
// Максимум

// Створи об'єкт, що описує звичайний дріб. Створи об'єкт, який має методи роботи з дробом:
// Складання 2-х об'єктів-дробів.
// Віднімання 2-х об'єктів-дробів.
// Множення 2-х об'єктів-дробів.
// Ділення 2-х об'єктів-дробів.
// Скорочення об'єкта-дробу.
// (Тобі потрібно буде створити ще деякі методи не зазначені в завданні, для отримання математично правильної відповіді)